* HansTausen_Hare
:PROPERTIES:
:header-args:jupyter-python+: :session ds :kernel ds
:clearpage: t
:END:

#+NAME: ingest_meta
#+BEGIN_SRC bash :results verbatim :exports results
cat meta.bsv | sed 's/|/@| /' | column -s"@" -t
#+END_SRC

#+RESULTS: ingest_meta
#+begin_example
Borehole ID                      | HansTausen_Hare
Place name                       | Hans Tausen Hare
Geographic location              | North Greenland
Ice type                         | Ice cap
Data Source                      | Zekollari email
Data DOI                         | 
Science Source                   | Zekollari, Harry, Huybrechts, Philippe, Noël, Brice, van de Berg, Willem Jan, van den Broeke, Michiel R.: Sensitivity, stability and future evolution of the world’s northernmost ice cap, Hans Tausen Iskappe (Greenland) , The Cryosphere 11(2), Copernicus GmbH, 805–825, 3 2017 
Science DOI                      | 10.5194/tc-11-805-2017
Date                             | 1995
Longitude [°E]                   | -36.67
Latitude [°N]                    | 82.84
Location Source                  | 10.5194/essd-2021-290
Depth of top measurement [m]     | 9.0
Depth of bottom measurement [m]  | 288
Ice thickness [m]                | 289
Coverage [% of thickness]        | 97
Ice thickness source             | See data source
Velocity [m/yr]                  | 
Note                             | Drill date: 10.34194/bullggu.v172.6749 
#+end_example

** Temperature

+ From H. Zekollari email (see [[./Zekollari-et-al-2017TC-boreholeT.xlsx]])

** Thickness

+ From [[citet:zekollari_2017][Zekollari (2017)]] text.
 
** Location

** Velocity

** Data                                                 :noexport:

#+NAME: ingest_data
#+BEGIN_SRC bash :exports results
cat data.csv | sort -t, -n -k1
#+END_SRC

#+RESULTS: ingest_data
|   d |     t |
|   9 | -18.5 |
|  19 | -16.7 |
|  29 | -15.7 |
|  40 | -14.9 |
|  70 | -13.5 |
|  94 | -12.5 |
| 121 | -11.5 |
| 146 |   -10 |
| 178 |    -9 |
| 201 |    -8 |
| 226 |  -6.9 |
| 246 |  -5.1 |
| 267 |    -3 |
| 288 |  -1.5 |

